app/controllers/book_lists_controller.rb

INSERT INTO "book_lists" ("created_at", "updated_at", "csv") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-02-17 21:11:45.156409"], ["updated_at", "2020-02-17 21:11:45.156409"], ["csv", "Untitled_spreadsheet_-_Sheet1.csv"]]
---
  def create
    @book_list = BookList.new(book_list_params)

    if @book_list.save