app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest") VALUES ($1, $2) RETURNING "id"  [["email", "juno@dog.com"], ["password_digest", "$2a$12$uQvIMh0IGXuiUPJrvax5nuPCUZsbliXXa2KugQ/52PWYnP5ge29i."]]